driver.yml
config:
  target: "http://localhost:6969"
  http:
      maxSockets: 10
  phases:
    - duration: 10
      arrivalRate: 10
  processor: "./functions.js"  
scenarios:
  - name: "Authen and send location" 
    engine: "socketio"
    flow:
    - function: "setParameter"
    - emit:
          channel: "authenticate"
          data:
              token: "{{ token }}"
          namespace: "/driver"
    - think: 10
    - loop:
        - emit:
            channel: "loc_changed"
            data:
                lat: 10.7772780
                long: 106.7044060
            namespace: "/driver"
        - think: 10
      count: 10
    - think: 60